Abhishek12890551/ESP32_WeatherStation_v2/ESP32_WeatherStation_v2.ino
/*
 * ESP32 Weather Station - Production Ready v2.1.0
 * Features:
 * - OTA Updates
 * - Error Recovery & Watchdog (FIXED)
 * - Secure Credentials Management
 * - Historical Data Storage
 * - Alert System (Gas Leak, Extreme Weather)
 * - MQ-135 Calibration (CO2, NH3, Benzene, Alcohol, Smoke)
 * - Connection Health Monitoring
 * - Remote Command Support
 * 
 * FIXES:
 * - Watchdog timeout during calibration
 * - Duplicate watchdog initialization on reboot
 * - Optimized calibration process
 * - Remote calibration trigger
 */

#include <WiFi.h>
#include <Wire.h>
#include <Adafruit_Sensor.h>
#include <Adafruit_BME280.h>
#include <Adafruit_SSD1306.h>
#include <Firebase_ESP_Client.h>
#include <ArduinoOTA.h>
#include <Preferences.h>
#include <esp_task_wdt.h>

#include <addons/TokenHelper.h>
#include <addons/RTDBHelper.h>
#include <HTTPClient.h>

// Include secrets (WiFi and Firebase credentials)
#include "secrets.h"

/* ================= CONFIGURATION ================= */
// Hardware
#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 64
#define MQ135_PIN 34
#define LED_STATUS 2          // Built-in LED for status
#define WATCHDOG_TIMEOUT 30   // 30 seconds

// Timing
#define UPLOAD_INTERVAL 10000      // 10 seconds for live data
#define HISTORY_INTERVAL 300000    // 5 minutes for historical data
#define DISPLAY_UPDATE 2000        // 2 seconds display refresh
#define WIFI_TIMEOUT 20000         // 20 seconds WiFi connection timeout
#define FIREBASE_TIMEOUT 15000     // 15 seconds Firebase timeout

// MQ-135 Calibration (Optimized for production)
#define RL_VALUE 10                // Load resistance in kilo ohms
#define RO_CLEAN_AIR_FACTOR 3.6    // RO in clean air / RS in clean air
#define CALIBRATION_SAMPLE_TIMES 20  // Reduced from 50 for faster calibration
#define CALIBRATION_SAMPLE_INTERVAL 250  // Reduced from 500ms

// Alert Thresholds
#define TEMP_HIGH_ALERT 35.0       // °C
#define TEMP_LOW_ALERT 10.0        // °C
#define HUMIDITY_HIGH_ALERT 80.0   // %
#define HUMIDITY_LOW_ALERT 30.0    // %
#define GAS_ALERT_THRESHOLD 300    // PPM (adjust for your environment)
#define PRESSURE_LOW_ALERT 980.0   // hPa (storm warning)

/* ================= CONFIGURATION ================= */
// Credentials are now in secrets.h (not tracked in git)
// The secrets.h file should define:
// - WIFI_SSID
// - WIFI_PASSWORD  
// - FIREBASE_API_KEY
// - FIREBASE_DATABASE_URL
// - FIREBASE_USER_EMAIL
// - FIREBASE_USER_PASSWORD
// - DEVICE_ID

// Firmware Info
const char* FIRMWARE_VERSION = "2.1.0";

/* ================= OBJECTS ================= */
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, -1);
Adafruit_BME280 bme;
FirebaseData fbdo;
FirebaseData streamFbdo;  // For listening to commands
FirebaseAuth auth;
FirebaseConfig config;
Preferences preferences;

/* ================= GLOBAL VARIABLES ================= */
// Timing
unsigned long lastUpload = 0;
unsigned long lastHistory = 0;
unsigned long lastDisplay = 0;
unsigned long wifiReconnectTime = 0;
unsigned long lastCommandCheck = 0;

// Sensor Data
float temperature = 0.0;
float humidity = 0.0;
float pressure = 0.0;
int gasRaw = 0;
float gasPPM = 0.0;
float Ro = 10.0;  // Sensor resistance in clean air

// Status Flags
bool wifiConnected = false;
bool firebaseReady = false;
bool sensorError = false;
bool hasTestedApi = false;
int reconnectAttempts = 0;

// Alert Flags
bool gasAlertActive = false;
bool tempAlertActive = false;

/* ================= FUNCTION DECLARATIONS ================= */
void initHardware();
void connectWiFi();
void handleWiFiDisconnect();
void setupOTA();
void initFirebase();
void setupFirebaseStream();
void setupPresenceDetection();
void readSensors();
void calibrateMQ135();
float calculateGasPPM(int adcValue);
void updateDisplay();
void uploadLiveData();
void storeHistoricalData();
void sendBootNotification();
void checkAlerts();
void sendAlert(String alertType, String message);
void checkFirebaseCommands();
void testAuthenticatedRequest(); // Added prototype

/* ================= SETUP ================= */
void setup() {
  Serial.begin(115200);
  delay(1000);
  Serial.println("\n\n=== ESP32 Weather Station v" + String(FIRMWARE_VERSION) + " ===");
  
  // Initialize Watchdog (compatible with both old and new ESP32 core versions)
  // Deinitialize first to prevent "already initialized" error on reboot
  esp_task_wdt_deinit();
  delay(100);
  
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    // ESP32 core v3.x and above
    esp_task_wdt_config_t wdt_config = {
      .timeout_ms = WATCHDOG_TIMEOUT * 1000,
      .idle_core_mask = 0,
      .trigger_panic = true
    };
    esp_task_wdt_init(&wdt_config);
  #else
    // ESP32 core v2.x
    esp_task_wdt_init(WATCHDOG_TIMEOUT, true);
  #endif
  esp_task_wdt_add(NULL);
  Serial.println("Watchdog initialized (30s timeout)");
  
  // Status LED
  pinMode(LED_STATUS, OUTPUT);
  digitalWrite(LED_STATUS, LOW);
  
  // Preferences (for storing calibration)
  preferences.begin("weather", false);
  Ro = preferences.getFloat("mq135_ro", 10.0);
  
  // Initialize Hardware
  initHardware();
  esp_task_wdt_reset();
  
  // Connect WiFi
  connectWiFi();
  esp_task_wdt_reset();
  
  // Setup OTA
  setupOTA();
  
  // Initialize Firebase
  initFirebase();
  esp_task_wdt_reset();
  
  // Calibration Strategy: Only on first boot or manual trigger
  // This prevents watchdog timeout on every reboot
  if (preferences.getBool("force_calib", false)) {
    Serial.println("Forced calibration requested...");
    calibrateMQ135();
    preferences.putBool("force_calib", false);
  } else if (!preferences.isKey("mq135_ro")) {
    // First time boot - needs calibration
    Serial.println("First boot detected - calibrating...");
    calibrateMQ135();
  } else {
    Serial.println("Using stored calibration. Ro = " + String(Ro, 2));
    Serial.println("To recalibrate, use Firebase command or reset preferences");
  }
  esp_task_wdt_reset();
  
  // Send boot notification
  sendBootNotification();
  
  Serial.println("Setup complete! System ready.");
  Serial.println("Free heap: " + String(ESP.getFreeHeap()) + " bytes");
  esp_task_wdt_reset();
}

/* ================= MAIN LOOP ================= */
void loop() {
  esp_task_wdt_reset();  // Reset watchdog
  
  // Handle OTA
  ArduinoOTA.handle();
  
  // Check WiFi connection
  if (WiFi.status() != WL_CONNECTED) {
    handleWiFiDisconnect();
  } else {
    wifiConnected = true;
    reconnectAttempts = 0;
  }
  
  // Check for remote commands (every 5 seconds)
  if (millis() - lastCommandCheck > 5000 && wifiConnected && firebaseReady) {
    checkFirebaseCommands();
    lastCommandCheck = millis();
    
    // Run API test once
    if (!hasTestedApi) {
      testAuthenticatedRequest();
      hasTestedApi = true;
    }
  }
  
