Abhishek12890551/ESP32_WeatherStation_v2/ESP32_WeatherStation_v2.ino
  // Read Sensors
  readSensors();
  
  // Update Display
  if (millis() - displayUpdatePrevMillis > DISPLAY_UPDATE) {
    updateDisplay();
    displayUpdatePrevMillis = millis();
  }
  
  // Upload Live Data
  if (millis() - lastUpload > UPLOAD_INTERVAL && wifiConnected) {
    uploadLiveData();
    lastUpload = millis();
  }
  
  // Store Historical Data
  if (millis() - sendHistoryPrevMillis > HISTORY_INTERVAL && wifiConnected) {
    storeHistoricalData();
    sendHistoryPrevMillis = millis();
  }
  
  // Check for Alerts
  checkAlerts();
  
  // Blink status LED to show alive
  static unsigned long ledBlink = 0;
  if (millis() - ledBlink > 1000) {
    digitalWrite(LED_STATUS, !digitalRead(LED_STATUS));
    ledBlink = millis();
  }
  
  delay(100);  // Small delay to prevent tight loop
}

/* ================= HARDWARE INITIALIZATION ================= */
void initHardware() {
  Serial.println("Initializing hardware...");
  
  // I2C
  Wire.begin(21, 22);
  
  // OLED Display
  if(!display.begin(SSD1306_SWITCHCAPVCC, 0x3C)) {
    Serial.println("ERROR: SSD1306 failed!");
    // Continue without display
  } else {
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setCursor(0, 0);
    display.println("Weather Station");
    display.println("v" + String(FIRMWARE_VERSION));
    display.println("Initializing...");
    display.display();
  }
  
  // BME280 Sensor
  if (!bme.begin(0x76) && !bme.begin(0x77)) {
    Serial.println("ERROR: BME280 not found!");
    sensorError = true;
    display.clearDisplay();
    display.setCursor(0, 20);
    display.println("SENSOR ERROR!");
    display.println("Check BME280");
    display.display();
    delay(3000);
  } else {
    Serial.println("BME280 initialized");
    // Configure BME280 for weather monitoring
    bme.setSampling(Adafruit_BME280::MODE_FORCED,
                    Adafruit_BME280::SAMPLING_X1, // temperature
                    Adafruit_BME280::SAMPLING_X1, // pressure
                    Adafruit_BME280::SAMPLING_X1, // humidity
                    Adafruit_BME280::FILTER_OFF);
  }
  
  // MQ-135 Pin
  pinMode(MQ135_PIN, INPUT);
  Serial.println("MQ-135 pin configured");
}

/* ================= WIFI CONNECTION ================= */
void connectWiFi() {
  Serial.print("Connecting to WiFi: ");
  Serial.println(WIFI_SSID);
  
  display.clearDisplay();
  display.setCursor(0, 20);
  display.println("Connecting WiFi...");
  display.display();
  
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  
  unsigned long startAttempt = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startAttempt < WIFI_TIMEOUT) {
    delay(500);
    Serial.print(".");
    esp_task_wdt_reset();  // Reset watchdog during connection
  }
  
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi Connected!");
    Serial.print("IP: ");
    Serial.println(WiFi.localIP());
    Serial.print("Signal: ");
    Serial.println(WiFi.RSSI());
    wifiConnected = true;
    
    display.clearDisplay();
    display.setCursor(0, 20);
    display.println("WiFi Connected!");
    display.print("IP: ");
    display.println(WiFi.localIP());
    display.display();
    delay(2000);
  } else {
    Serial.println("\nWiFi Connection Failed!");
    wifiConnected = false;
    
    display.clearDisplay();
    display.setCursor(0, 20);
    display.println("WiFi Failed!");
    display.println("Retrying...");
    display.display();
  }
}

void handleWiFiDisconnect() {
  if (millis() - wifiReconnectTime > 30000) {  // Try reconnect every 30s
    Serial.println("WiFi disconnected. Reconnecting...");
    wifiConnected = false;
    reconnectAttempts++;
    
    if (reconnectAttempts > 5) {
      Serial.println("Too many reconnect attempts. Rebooting...");
      delay(1000);
      ESP.restart();
    }
    
    WiFi.disconnect();
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    wifiReconnectTime = millis();
  }
}

/* ================= OTA SETUP ================= */
void setupOTA() {
  ArduinoOTA.setHostname(DEVICE_ID);
  ArduinoOTA.setPassword("weather2024");  // Change this!
  
  ArduinoOTA.onStart([]() {
    String type = (ArduinoOTA.getCommand() == U_FLASH) ? "sketch" : "filesystem";
    Serial.println("OTA Update: " + type);
    display.clearDisplay();
    display.setCursor(0, 20);
    display.println("OTA UPDATE");
    display.println("DO NOT POWER OFF");
    display.display();
    
    // Disable watchdog during OTA
    esp_task_wdt_delete(NULL);
  });
  
  ArduinoOTA.onEnd([]() {
    Serial.println("\nOTA Complete!");
    display.clearDisplay();
    display.setCursor(0, 20);
    display.println("Update Complete!");
    display.println("Rebooting...");
    display.display();
  });
  
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    unsigned int percent = (progress / (total / 100));
    Serial.printf("Progress: %u%%\r", percent);
    
    display.clearDisplay();
    display.setCursor(0, 20);
    display.println("Updating...");
    display.print(percent);
    display.println("%");
    display.display();
  });
  
  ArduinoOTA.onError([](ota_error_t error) {
    Serial.printf("OTA Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) Serial.println("Auth Failed");
    else if (error == OTA_BEGIN_ERROR) Serial.println("Begin Failed");
    else if (error == OTA_CONNECT_ERROR) Serial.println("Connect Failed");
    else if (error == OTA_RECEIVE_ERROR) Serial.println("Receive Failed");
    else if (error == OTA_END_ERROR) Serial.println("End Failed");
    
    // Re-enable watchdog
    esp_task_wdt_add(NULL);
  });
  
  ArduinoOTA.begin();
  Serial.println("OTA Ready");
}

/* ================= FIREBASE INITIALIZATION ================= */
void initFirebase() {
  Serial.println("Initializing Firebase...");
  
  display.clearDisplay();
  display.setCursor(0, 20);
  display.println("Connecting to");
  display.println("Firebase...");
  display.display();
  
  config.api_key = FIREBASE_API_KEY;
  config.database_url = FIREBASE_DATABASE_URL;
  auth.user.email = FIREBASE_USER_EMAIL;
  auth.user.password = FIREBASE_USER_PASSWORD;
  
