Abhishek12890551/ESP32_WeatherStation_v2/ESP32_WeatherStation_v2.ino
  config.token_status_callback = tokenStatusCallback;
  config.timeout.serverResponse = FIREBASE_TIMEOUT;
  config.max_token_generation_retry = 5;
  
  fbdo.setResponseSize(4096);
  
  Firebase.begin(&config, &auth);
  Firebase.reconnectWiFi(true);
  
  // Wait for authentication
  unsigned long startWait = millis();
  while (!Firebase.ready() && millis() - startWait < 30000) {
    delay(100);
    esp_task_wdt_reset();  // Reset watchdog during Firebase init
  }
  
  // Check if Firebase is ready and run tasks
  if (Firebase.ready()) {
    firebaseReady = true;

    // Run API test once
    if (!hasTestedApi) {
      testAuthenticatedRequest();
      hasTestedApi = true;
    }
    
    Serial.println("Firebase Connected!");
    
    display.clearDisplay();
    display.setCursor(0, 20);
    display.println("Firebase Ready!");
    display.display();
    delay(2000);
    
    // Setup stream for receiving commands
    setupFirebaseStream();
    
    // Setup presence detection (auto-offline on disconnect)
    setupPresenceDetection();
  } else {
    Serial.println("Firebase Connection Failed!");
    firebaseReady = false;
    
    display.clearDisplay();
    display.setCursor(0, 20);
    display.println("Firebase Failed!");
    display.display();
    delay(2000);
  }
}

void setupFirebaseStream() {
  // Listen for commands from dashboard (e.g., recalibrate, reboot)
  String streamPath = "/weather_station/" + String(DEVICE_ID) + "/commands";
  if (Firebase.RTDB.beginStream(&streamFbdo, streamPath.c_str())) {
    Serial.println("Stream started: " + streamPath);
  } else {
    Serial.println("Stream failed to start");
  }
}

void setupPresenceDetection() {
  // Set initial status to "online"
  String statusPath = "/weather_station/" + String(DEVICE_ID) + "/meta/status";
  String lastSeenPath = "/weather_station/" + String(DEVICE_ID) + "/meta/last_seen";
  
  if (Firebase.RTDB.setString(&fbdo, statusPath.c_str(), "online")) {
    Serial.println("✓ Status set to: online");
    
    // Set initial last_seen timestamp
    if (Firebase.RTDB.setTimestamp(&fbdo, lastSeenPath.c_str())) {
      Serial.println("✓ Presence tracking enabled (last_seen timestamp)");
      Serial.println("  Note: Middleware will check timestamp freshness for online/offline status");
    }
  } else {
    Serial.println("✗ Failed to set online status");
  }
}

/* ================= SENSOR READING ================= */
void readSensors() {
  if (sensorError) return;
  
  // Force BME280 reading
  bme.takeForcedMeasurement();
  
  // Read BME280
  float newTemp = bme.readTemperature();
  float newHum = bme.readHumidity();
  float newPres = bme.readPressure() / 100.0F;
  
  // Validate readings
  if (!isnan(newTemp) && newTemp > -40 && newTemp < 85) {
    temperature = newTemp;
  }
  if (!isnan(newHum) && newHum >= 0 && newHum <= 100) {
    humidity = newHum;
  }
  if (!isnan(newPres) && newPres > 800 && newPres < 1200) {
    pressure = newPres;
  }
  
  // Read MQ-135
  gasRaw = analogRead(MQ135_PIN);
  gasPPM = calculateGasPPM(gasRaw);
}

/* ================= MQ-135 CALIBRATION & CALCULATION ================= */
void calibrateMQ135() {
  Serial.println("Calibrating MQ-135... Please ensure clean air!");
  
  display.clearDisplay();
  display.setCursor(0, 10);
  display.println("CALIBRATING");
  display.println("MQ-135");
  display.println("");
  display.println("Ensure clean air!");
  display.display();
  
  delay(5000);  // Wait for sensor to stabilize
  esp_task_wdt_reset();  // Reset watchdog after delay
  
  float rs = 0;
  for (int i = 0; i < CALIBRATION_SAMPLE_TIMES; i++) {
    int adcValue = analogRead(MQ135_PIN);
    float voltage = adcValue * (3.3 / 4095.0);
    float rsTemp = ((3.3 * RL_VALUE) / voltage) - RL_VALUE;
    rs += rsTemp;
    
    display.clearDisplay();
    display.setCursor(0, 10);
    display.println("CALIBRATING");
    display.print("Sample: ");
    display.print(i + 1);
    display.print("/");
    display.println(CALIBRATION_SAMPLE_TIMES);
    
    // Show progress bar
    int barWidth = 100;
    int progress = (i * barWidth) / CALIBRATION_SAMPLE_TIMES;
    display.setCursor(0, 40);
    display.print("[");
    for (int j = 0; j < barWidth / 10; j++) {
      if (j < progress / 10) display.print("=");
      else display.print(" ");
    }
    display.print("]");
    display.display();
    
    delay(CALIBRATION_SAMPLE_INTERVAL);
    
    // Reset watchdog every 5 samples to prevent timeout
    if (i % 5 == 0) {
      esp_task_wdt_reset();
      Serial.print(".");
    }
  }
  Serial.println();
  
  rs = rs / CALIBRATION_SAMPLE_TIMES;
  Ro = rs / RO_CLEAN_AIR_FACTOR;
  
  preferences.putFloat("mq135_ro", Ro);
  
  Serial.print("Calibration complete! Ro = ");
  Serial.println(Ro);
  
  display.clearDisplay();
  display.setCursor(0, 20);
  display.println("Calibration Done!");
  display.print("Ro = ");
  display.println(Ro, 2);
  display.display();
  delay(3000);
  
  esp_task_wdt_reset();  // Final reset after calibration
}

float calculateGasPPM(int adcValue) {
  float voltage = adcValue * (3.3 / 4095.0);
  
  if (voltage == 0) return 0;
  
  float rs = ((3.3 * RL_VALUE) / voltage) - RL_VALUE;
  
  if (rs < 0) rs = 0;
  
  float ratio = rs / Ro;
  
  // MQ-135 approximation for CO2 (adjust curve for other gases)
  // PPM = a * ratio^b
  // For CO2: a = 116.6020682, b = -2.769034857
  float ppm = 116.6020682 * pow(ratio, -2.769034857);
  
  return ppm;
}

/* ================= DISPLAY UPDATE ================= */
void updateDisplay() {
  display.clearDisplay();
  
  // Status Bar
  display.setTextSize(1);
  display.setCursor(0, 0);
  
  if (firebaseReady && wifiConnected) {
    display.print("ONLINE");
  } else if (wifiConnected) {
    display.print("WiFi OK");
  } else {
    display.print("OFFLINE");
  }
  
  // WiFi Signal
  display.setCursor(80, 0);
  int rssi = WiFi.RSSI();
  if (rssi > -60) display.print("||||");
  else if (rssi > -70) display.print("|||");
  else if (rssi > -80) display.print("||");
  else if (rssi > -90) display.print("|");
  else display.print("X");
  
