Abhishek12890551/ESP32_WeatherStation_v2/ESP32_WeatherStation_v2.ino
  // Temperature (Large)
  display.setTextSize(2);
  display.setCursor(0, 15);
  display.print(temperature, 1);
  display.setTextSize(1);
  display.print("C");
  
  // Alert Indicator
  if (gasAlertActive || tempAlertActive) {
    display.setTextSize(2);
    display.setCursor(100, 15);
    display.print("!");
  }
  
  // Details
  display.setTextSize(1);
  display.setCursor(0, 38);
  display.print("Hum: ");
  display.print(humidity, 0);
  display.println("%");
  
  display.setCursor(0, 48);
  display.print("Air: ");
  display.print(gasPPM, 0);
  display.println(" ppm");
  
  display.setCursor(0, 56);
  display.print("P:");
  display.print(pressure, 0);
  display.print("hPa");
  
  display.display();
}

/* ================= FIREBASE UPLOAD ================= */
void uploadLiveData() {
  if (!Firebase.ready()) {
    Serial.println("Firebase not ready");
    firebaseReady = false;
    return;
  }
  
  firebaseReady = true;
  
  FirebaseJson json;
  String basePath = "/weather_station/" + String(DEVICE_ID);
  
  // Live sensor data
  json.set("live/temperature", temperature);
  json.set("live/humidity", humidity);
  json.set("live/pressure", pressure);
  json.set("live/gas_raw", gasRaw);
  json.set("live/gas_ppm", gasPPM);
  json.set("live/timestamp/.sv", "timestamp");  // Firebase server timestamp
  
  // Device metadata
  json.set("meta/device_id", DEVICE_ID);
  json.set("meta/firmware_version", FIRMWARE_VERSION);
  json.set("meta/status", "online");
  json.set("meta/signal_strength", WiFi.RSSI());
  json.set("meta/uptime_seconds", millis() / 1000);
  json.set("meta/free_heap", ESP.getFreeHeap());
  json.set("meta/sensor_ro", Ro);
  json.set("meta/last_seen/.sv", "timestamp");  // Update last_seen for presence detection
  
  // Alert status
  json.set("alerts/gas_alert", gasAlertActive);
  json.set("alerts/temp_alert", tempAlertActive);
  
  if (Firebase.RTDB.updateNode(&fbdo, basePath.c_str(), &json)) {
    Serial.println("✓ Live data uploaded");
  } else {
    Serial.print("✗ Upload failed: ");
    Serial.println(fbdo.errorReason());
  }
}

void storeHistoricalData() {
  if (!Firebase.ready()) return;
  
  // Store historical data with timestamp
  String historyPath = "/weather_station/" + String(DEVICE_ID) + "/history";
  
  FirebaseJson json;
  json.set("temperature", temperature);
  json.set("humidity", humidity);
  json.set("pressure", pressure);
  json.set("gas_ppm", gasPPM);
  json.set("timestamp/.sv", "timestamp");  // Firebase server timestamp
  
  // Push to history (Firebase auto-generates unique key)
  if (Firebase.RTDB.pushJSON(&fbdo, historyPath.c_str(), &json)) {
    Serial.println("✓ Historical data stored");
    
    // Optional: Clean old history (keep last 100 records)
    // This prevents unlimited growth
    cleanOldHistory();
  } else {
    Serial.print("✗ History failed: ");
    Serial.println(fbdo.errorReason());
  }
}

void cleanOldHistory() {
  // This runs once per day to clean old records
  static unsigned long lastClean = 0;
  if (millis() - lastClean < 86400000) return;  // 24 hours
  
  String historyPath = "/weather_station/" + String(DEVICE_ID) + "/history";
  
  // Query to get count
  if (Firebase.RTDB.getJSON(&fbdo, historyPath.c_str())) {
    FirebaseJson &json = fbdo.jsonObject();
    size_t count = json.iteratorBegin();
    
    // If more than 500 records, delete oldest 100
    if (count > 500) {
      Serial.println("Cleaning old history records...");
      // Implement deletion logic here if needed
    }
    
    json.iteratorEnd();
  }
  
  lastClean = millis();
}

void sendBootNotification() {
  if (!Firebase.ready()) return;
  
  String notifPath = "/weather_station/" + String(DEVICE_ID) + "/notifications";
  
  FirebaseJson json;
  json.set("type", "boot");
  json.set("message", "Device started");
  json.set("firmware", FIRMWARE_VERSION);
  json.set("timestamp/.sv", "timestamp");
  json.set("ip", WiFi.localIP().toString());
  
  if (Firebase.RTDB.pushJSON(&fbdo, notifPath.c_str(), &json)) {
    Serial.println("✓ Boot notification sent");
  }
}

/* ================= ALERTS ================= */
void checkAlerts() {
  // Gas Leak Alert
  if (gasPPM > GAS_ALERT_THRESHOLD) {
    if (!gasAlertActive) {
      gasAlertActive = true;
      sendAlert("gas_leak", "High gas concentration detected: " + String(gasPPM, 0) + " ppm");
      Serial.println("⚠ GAS ALERT!");
    }
  } else {
    gasAlertActive = false;
  }
  
  // Temperature Alerts
  if (temperature > TEMP_HIGH_ALERT || temperature < TEMP_LOW_ALERT) {
    if (!tempAlertActive) {
      tempAlertActive = true;
      String msg = (temperature > TEMP_HIGH_ALERT) ? "High temperature" : "Low temperature";
      sendAlert("temperature", msg + ": " + String(temperature, 1) + "°C");
      Serial.println("⚠ TEMP ALERT!");
    }
  } else {
    tempAlertActive = false;
  }
  
  // Humidity Alert
  static bool humidityAlertSent = false;
  if (humidity > HUMIDITY_HIGH_ALERT || humidity < HUMIDITY_LOW_ALERT) {
    if (!humidityAlertSent) {
      String msg = (humidity > HUMIDITY_HIGH_ALERT) ? "High humidity" : "Low humidity";
      sendAlert("humidity", msg + ": " + String(humidity, 0) + "%");
      humidityAlertSent = true;
    }
  } else {
    humidityAlertSent = false;
  }
  
  // Low Pressure (Storm Warning)
  static bool pressureAlertSent = false;
  if (pressure < PRESSURE_LOW_ALERT) {
    if (!pressureAlertSent) {
      sendAlert("pressure", "Low pressure detected: " + String(pressure, 1) + " hPa - Storm warning");
      pressureAlertSent = true;
    }
  } else {
    pressureAlertSent = false;
  }
}

void sendAlert(String alertType, String message) {
  if (!Firebase.ready()) return;
  
  String alertPath = "/weather_station/" + String(DEVICE_ID) + "/alerts";
  
  FirebaseJson json;
  json.set("type", alertType);
  json.set("message", message);
  json.set("severity", "high");
  json.set("timestamp/.sv", "timestamp");
  json.set("device_id", DEVICE_ID);
  json.set("acknowledged", false);
  
  if (Firebase.RTDB.pushJSON(&fbdo, alertPath.c_str(), &json)) {
    Serial.println("✓ Alert sent: " + alertType);
  }
}

/* ================= FIREBASE COMMANDS ================= */
void checkFirebaseCommands() {
  if (!Firebase.ready()) return;
  
  String commandPath = "/weather_station/" + String(DEVICE_ID) + "/commands";
  
  // Read commands
  if (Firebase.RTDB.getJSON(&fbdo, commandPath.c_str())) {
    FirebaseJson &json = fbdo.jsonObject();
    FirebaseJsonData result;
    
    // Check for calibration command
    if (json.get(result, "calibrate")) {
      if (result.type == "bool" && result.boolValue == true) {
        Serial.println("📡 Remote calibration requested");
        
        display.clearDisplay();
        display.setCursor(0, 20);
        display.println("Remote Command:");
        display.println("Calibrating...");
        display.display();
        
        calibrateMQ135();
        
