Abhishek12890551/ESP32_WeatherStation_v2/ESP32_WeatherStation_v2.ino
        // Clear the command
        Firebase.RTDB.setBool(&fbdo, (commandPath + "/calibrate").c_str(), false);
        
        // Send confirmation
        FirebaseJson confirmJson;
        confirmJson.set("type", "calibration_complete");
        confirmJson.set("message", "Calibration completed. Ro = " + String(Ro, 2));
        confirmJson.set("timestamp/.sv", "timestamp");
        Firebase.RTDB.pushJSON(&fbdo, 
          ("/weather_station/" + String(DEVICE_ID) + "/notifications").c_str(), 
          &confirmJson);
      }
    }
    
    // Check for reboot command
    if (json.get(result, "reboot")) {
      if (result.type == "bool" && result.boolValue == true) {
        Serial.println("📡 Remote reboot requested");
        
        display.clearDisplay();
        display.setCursor(0, 20);
        display.println("Remote Command:");
        display.println("Rebooting...");
        display.display();
        
        // Clear the command first
        Firebase.RTDB.setBool(&fbdo, (commandPath + "/reboot").c_str(), false);
        
        delay(1000);
        ESP.restart();
      }
    }
    
    // Check for reset command (clear preferences)
    if (json.get(result, "reset_preferences")) {
      if (result.type == "bool" && result.boolValue == true) {
        Serial.println("📡 Reset preferences requested");
        
        preferences.clear();
        preferences.putBool("force_calib", true);
        
        // Clear the command
        Firebase.RTDB.setBool(&fbdo, (commandPath + "/reset_preferences").c_str(), false);
        
        Serial.println("Preferences cleared. Rebooting...");
        delay(1000);
        ESP.restart();
      }
    }
    
    // Check for display test command
    if (json.get(result, "test_display")) {
      if (result.type == "bool" && result.boolValue == true) {
        Serial.println("📡 Display test requested");
        
        display.clearDisplay();
        display.setTextSize(2);
        display.setCursor(10, 20);
        display.println("TEST OK!");
        display.display();
        delay(3000);
        
        // Clear the command
        Firebase.RTDB.setBool(&fbdo, (commandPath + "/test_display").c_str(), false);
      }
    }
  }
}

/* ================= API TEST ================= */
void testAuthenticatedRequest() {
  if (WiFi.status() != WL_CONNECTED || !Firebase.ready()) {
    Serial.println("Cannot test API: WiFi or Firebase not ready");
    return;
  }

  Serial.println("\n--- Testing Authenticated API Request ---");
  
  // Get the current ID token from the Firebase Auth object
  // Note: This token is automatically refreshed by the library
  String idToken = auth.token.id_token;
  
  if (idToken.length() == 0) {
    Serial.println("Error: No ID token available yet");
    return;
  }
  
  HTTPClient http;
  String apiUrl = "https://us-central1-esp32-weather-station-2508e.cloudfunctions.net/api/live";
  
  Serial.print("Requesting: ");
  Serial.println(apiUrl);
  
  http.begin(apiUrl);
  http.addHeader("Authorization", "Bearer " + idToken);
  
  int httpCode = http.GET();
  
  if (httpCode > 0) {
    Serial.printf("HTTP Code: %d\n", httpCode);
    if (httpCode == HTTP_CODE_OK) {
      String payload = http.getString();
      Serial.println("Response: " + payload);
      Serial.println("✓ Authenticated API access successful!");
    } else {
      Serial.printf("✗ API request failed: %s\n", http.errorToString(httpCode).c_str());
    }
  } else {
    Serial.printf("✗ Connection failed: %s\n", http.errorToString(httpCode).c_str());
  }
  
  http.end();
  Serial.println("-----------------------------------------\n");
}

/* ================= END OF CODE ================= */